[
{"apt_name": "Bouncing Golf", "apt_description": "Bouncing Golf is a cyberespionage campaign targeting Middle Eastern countries.[1]", "software_item": [{"software_name": "GolfSpy", "software_description": "Access Call Log, Access Contact List, Application Discovery, Broadcast Receivers, Capture Audio, Capture Camera, Capture Clipboard Data, Capture SMS Messages, Data Encrypted, Data from Local System, Delete Device Data, Deliver Malicious App via Other Means, Location Tracking, Obfuscated Files or Information, Process Discovery, Screen Capture, Standard Application Layer Protocol, System Information Discovery"}]},
{"attack_pattern_name": "Masquerade as Legitimate Application", "attack_pattern_description": "Bouncing Golf distributed malware as repackaged legitimate applications, with the malicious code in the com.golf package.[1]", "attack_pattern_platforms": "Android, iOS", "attack_pattern_CAPEC_ID": null, "attack_pattern_DataSources": null, "attack_pattern_detection": "Users can detect malicious applications by watching for nuances that could indicate the application is not the intended one when it is being installed.", "attack_pattern_mitigations": [{"mitigations_name": "User Guidance", "mitigations_description": "Users should be encouraged to only install apps from authorized app stores, which are less likely to contain malicious repackaged apps."}]},
{"attack_pattern_name": "Deliver Malicious App via Other Means", "attack_pattern_description": "Bouncing Golf delivered GolfSpy via a hosted application binary advertised on social media.[1]", "attack_pattern_platforms": "Android, iOS", "attack_pattern_CAPEC_ID": null, "attack_pattern_DataSources": null, "attack_pattern_detection": "An EMM/MDM or mobile threat defense solution may be able to identify the presence of apps installed from sources other than an authorized app store. An EMM/MDM or mobile threat defense solution may be able to identify Android devices configured to allow apps to be installed from \"Unknown Sources\".Enterprise email security solutions can identify the presence of Android or iOS application packages within email messages.", "attack_pattern_mitigations": [{"mitigations_name": "Enterprise Policy", "mitigations_description": "On iOS, the allowEnterpriseAppTrust and allowEnterpriseAppTrustModification configuration profile restrictions can be used to prevent users from installing apps signed using enterprise distribution keys."}, {"mitigations_name": "User Guidance", "mitigations_description": "iOS 9 and above requires explicit user consent before allowing installation of applications signed with enterprise distribution keys rather than installed from Apple's App Store. Users should be encouraged to not agree to installation of applications signed with enterprise distribution keys unless absolutely certain of the source of the application. On Android, the \"Unknown Sources\" setting must be enabled for users to install apps from sources other than an authorized app store (such as the Google Play Store), so users should be encouraged not to enable that setting."}]}
]