[
{"apt_name": "GCMAN", "apt_description": "GCMAN is a threat group that focuses on targeting banks for the purpose of transferring money to e-currency services. [1]", "software_item": []},
{"attack_pattern_name": "Remote Services: VNC", "attack_pattern_description": "GCMAN uses VNC for lateral movement.[1]", "attack_pattern_platforms": "Linux, Windows, macOS", "attack_pattern_CAPEC_ID": "CAPEC-555", "attack_pattern_DataSources": "Netflow/Enclave netflow, Network protocol analysis, Process use of network", "attack_pattern_detection": "Use of VNC may be legitimate depending on the environment and how it’s used. Other factors, such as access patterns and activity that occurs after a remote login, may indicate suspicious or malicious behavior with VNC.", "attack_pattern_mitigations": [{"mitigations_name": "Audit", "mitigations_description": "Inventory workstations for unauthorized VNC server software."}, {"mitigations_name": "Disable or Remove Feature or Program", "mitigations_description": "Uninstall any VNC server software where not required."}, {"mitigations_name": "Filter Network Traffic", "mitigations_description": "VNC defaults to TCP ports 5900 for the server, 5800 for browser access, and 5500 for a viewer in listening mode. Filtering or blocking these ports will inhibit VNC traffic utilizing default ports."}, {"mitigations_name": "Limit Software Installation", "mitigations_description": "Restrict software installation to user groups that require it. A VNC server must be manually installed by the user or adversary."}]},
{"attack_pattern_name": "Remote Services: SSH", "attack_pattern_description": "GCMAN uses Putty for lateral movement.[1]", "attack_pattern_platforms": "Linux, macOS", "attack_pattern_CAPEC_ID": "CAPEC-555", "attack_pattern_DataSources": "Authentication logs, Netflow/Enclave netflow, Network protocol analysis, Process use of network", "attack_pattern_detection": "Use of SSH may be legitimate depending on the environment and how it’s used. Other factors, such as access patterns and activity that occurs after a remote login, may indicate suspicious or malicious behavior with SSH. Monitor for user accounts logged into systems they would not normally access or access patterns to multiple systems over a relatively short period of time.", "attack_pattern_mitigations": [{"mitigations_name": "Disable or Remove Feature or Program", "mitigations_description": "Disable the SSH daemon on systems that do not require it."}, {"mitigations_name": "Multi-factor Authentication", "mitigations_description": "Require multi-factor authentication for SSH connections wherever possible."}, {"mitigations_name": "User Account Management", "mitigations_description": "Limit which user accounts are allowed to login via SSH."}]}
]