[
{"apt_name": "Scarlet Mimic", "apt_description": "Scarlet Mimic is a threat group that has targeted minority rights activists. This group has not been directly linked to a government source, but the group's motivations appear to overlap with those of the Chinese government. While there is some overlap between IP addresses used by Scarlet Mimic and Putter Panda, it has not been concluded that the groups are the same. [1]", "software_item": [{"software_name": "CallMe", "software_description": "Command and Scripting Interpreter: Unix Shell, Encrypted Channel: Symmetric Cryptography, Exfiltration Over C2 Channel, Ingress Tool Transfer"}, {"software_name": "FakeM", "software_description": "Data Obfuscation: Protocol Impersonation, Encrypted Channel: Symmetric Cryptography, Input Capture: Keylogging, Non-Application Layer Protocol"}, {"software_name": "MobileOrder", "software_description": "Browser Bookmark Discovery, Data from Local System, Exfiltration Over C2 Channel, File and Directory Discovery, Ingress Tool Transfer, Process Discovery, System Information Discovery"}, {"software_name": "Psylo", "software_description": "Application Layer Protocol: Web Protocols, Exfiltration Over C2 Channel, File and Directory Discovery, Indicator Removal on Host: Timestomp, Ingress Tool Transfer"}]},
{"attack_pattern_name": "Masquerading: Right-to-Left Override", "attack_pattern_description": "Scarlet Mimic has used the left-to-right override character in self-extracting RAR archive spearphishing attachment file names.[1]", "attack_pattern_platforms": "Linux, Windows, macOS", "attack_pattern_CAPEC_ID": null, "attack_pattern_DataSources": "File monitoring", "attack_pattern_detection": "Detection methods should include looking for common formats of RTLO characters within filenames such as \\u202E, [U+202E], and %E2%80%AE. Defenders should also check their analysis tools to ensure they do not interpret the RTLO character and instead print the true name of the file containing it.", "attack_pattern_mitigations": []}
]